Ran Plan for 2 projects:

1. project: `prod` dir: `deployment/prod/terraform` workspace: `default`
1. project: `dev` dir: `deployment/dev/terraform` workspace: `default`
---

### 1. project: `prod` dir: `deployment/prod/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.postgres.google_sql_database_instance.default has changed
! resource "google_sql_database_instance" "default" {
!       available_maintenance_versions = [
!           "POSTGRES_15_12.R20250302.00_04" -> "POSTGRES_15_12.R20250302.00_12",
        ]
        id                             = "backstage-prod"
!       maintenance_version            = "POSTGRES_15_10.R20250112.01_03" -> "POSTGRES_15_12.R20250302.00_04"
        name                           = "backstage-prod"
        # (17 unchanged attributes hidden)

!       settings {
!           version                      = 145 -> 200
            # (16 unchanged attributes hidden)

            # (6 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_secret_manager_secret.backstage-bits-credentials["backstage-soundcheck-http-collector-token"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"                 = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "service"                    = "backstage"
+           "terraform-module"           = "terraform-bits-backstage-prod"
+           "type"                       = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "backstage"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "backstage-soundcheck-http-collector-token"
+       terraform_labels      = {
+           "created-by"                 = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "service"                    = "backstage"
+           "terraform-module"           = "terraform-bits-backstage-prod"
+           "type"                       = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret_iam_member.ksa-access["backstage-soundcheck-http-collector-token"] will be created
+ resource "google_secret_manager_secret_iam_member" "ksa-access" {
+       etag      = (known after apply)
+       id        = (known after apply)
+       member    = "principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage/sa/backstage"
+       project   = "bits-backstage-prod"
+       role      = "roles/secretmanager.secretAccessor"
+       secret_id = "backstage-soundcheck-http-collector-token"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. project: `dev` dir: `deployment/dev/terraform` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform1.10.5 plan -input=false -refresh -out "/atlantis/repos/broadinstitute/backstage/243/default/deployment/dev/terraform/dev-default.tfplan"' in '/atlantis/repos/broadinstitute/backstage/243/default/deployment/dev/terraform': exit status 1
module.postgres.null_resource.module_depends_on: Refreshing state... [id=6215754838028235222]
google_project_service.api_services["sts.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/sts.googleapis.com]
google_project_service.api_services["monitoring.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/monitoring.googleapis.com]
google_project_service.api_services["compute.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/compute.googleapis.com]
google_project_service.api_services["iap.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/iap.googleapis.com]
google_project_service.api_services["secretmanager.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/secretmanager.googleapis.com]
module.db_service_accounts.google_service_account.service_accounts["backstage"]: Refreshing state... [id=projects/bits-backstage-dev/serviceAccounts/backstage@bits-backstage-dev.iam.gserviceaccount.com]
google_project_service.api_services["sqladmin.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/sqladmin.googleapis.com]
data.google_client_config.current: Reading...
google_project_service.api_services["iam.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/iam.googleapis.com]
google_storage_bucket.tech-docs: Refreshing state... [id=bits-backstage-dev-techdocs]
data.google_client_config.current: Read complete after 0s [id=projects/bits-backstage-dev/regions/us-east4/zones/]
google_project_service.api_services["cloudidentity.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/cloudidentity.googleapis.com]
google_project_service.api_services["iamcredentials.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/iamcredentials.googleapis.com]
google_project_iam_member.team_access: Refreshing state... [id=bits-backstage-dev/roles/editor/group:devnull@broadinstitute.org]
data.google_project.core: Reading...
data.google_project.core: Read complete after 0s [id=projects/bits-backstage-dev]
google_project_iam_member.sa_access: Refreshing state... [id=bits-backstage-dev/roles/owner/group:devnull-sa@broadinstitute.org]
data.google_project.gke: Reading...
data.google_project.gke: Read complete after 0s [id=projects/bits-gke-clusters]
google_secret_manager_secret.backstage-bits-credentials["backstage-skills-slack-app-token"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/backstage-skills-slack-app-token]
google_secret_manager_secret.backstage-bits-credentials["pagerduty-client-secret"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/pagerduty-client-secret]
google_secret_manager_secret.backstage-bits-credentials["auth-github-client-secret"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/auth-github-client-secret]
google_secret_manager_secret.backstage-bits-credentials["pagerduty-client-id"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/pagerduty-client-id]
google_secret_manager_secret.backstage-bits-credentials["backstage-skills-slack-signing-secret"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/backstage-skills-slack-signing-secret]
google_secret_manager_secret.backstage-bits-credentials["auth-google-client-secret"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/auth-google-client-secret]
google_secret_manager_secret.backstage-bits-credentials["backstage-skills-slack-bot-token"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/backstage-skills-slack-bot-token]
google_secret_manager_secret.backstage-bits-credentials["backstage-insights-token"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/backstage-insights-token]
google_secret_manager_secret.backstage-bits-credentials["github-app-backstage-bits-credentials"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/github-app-backstage-bits-credentials]
google_secret_manager_secret.backstage-bits-credentials["auth-github-client-id"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/auth-github-client-id]
google_secret_manager_secret.backstage-bits-credentials["backstage-license-key"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/backstage-license-key]
google_secret_manager_secret.backstage-bits-credentials["backstage-soundcheck-slack-bot-token"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/backstage-soundcheck-slack-bot-token]
google_secret_manager_secret.backstage-bits-credentials["auth-google-client-id"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/auth-google-client-id]
google_secret_manager_secret.backstage-bits-credentials["backstage-soundcheck-slack-app-token"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/backstage-soundcheck-slack-app-token]
google_secret_manager_secret.backstage-bits-credentials["backstage-soundcheck-slack-signing-secret"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/backstage-soundcheck-slack-signing-secret]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-gke-clusters-dev=>roles/container.viewer"]: Refreshing state... [id=bits-gke-clusters-dev/roles/container.viewer/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-gke-clusters-dev=>roles/container.clusterViewer"]: Refreshing state... [id=bits-gke-clusters-dev/roles/container.clusterViewer/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/monitoring.viewer"]: Refreshing state... [id=bits-backstage-dev/roles/monitoring.viewer/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/cloudsql.client"]: Refreshing state... [id=bits-backstage-dev/roles/cloudsql.client/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-gke-clusters=>roles/container.viewer"]: Refreshing state... [id=bits-gke-clusters/roles/container.viewer/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/monitoring.metricWriter"]: Refreshing state... [id=bits-backstage-dev/roles/monitoring.metricWriter/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/cloudsql.instanceUser"]: Refreshing state... [id=bits-backstage-dev/roles/cloudsql.instanceUser/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-gke-clusters=>roles/container.clusterViewer"]: Refreshing state... [id=bits-gke-clusters/roles/container.clusterViewer/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/secretmanager.secretAccessor"]: Refreshing state... [id=bits-backstage-dev/roles/secretmanager.secretAccessor/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.ksa-access["backstage-soundcheck-slack-app-token"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/backstage-soundcheck-slack-app-token/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage-dev/sa/backstage]
google_secret_manager_secret_iam_member.ksa-access["auth-github-client-id"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/auth-github-client-id/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage-dev/sa/backstage]
google_secret_manager_secret_iam_member.ksa-access["backstage-skills-slack-bot-token"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/backstage-skills-slack-bot-token/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage-dev/sa/backstage]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=bits-backstage-dev/roles/iam.serviceAccountTokenCreator/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.ksa-access["backstage-skills-slack-app-token"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/backstage-skills-slack-app-token/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage-dev/sa/backstage]
google_secret_manager_secret_iam_member.ksa-access["backstage-soundcheck-slack-signing-secret"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/backstage-soundcheck-slack-signing-secret/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage-dev/sa/backstage]
google_secret_manager_secret_iam_member.ksa-access["backstage-skills-slack-signing-secret"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/backstage-skills-slack-signing-secret/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage-dev/sa/backstage]
google_secret_manager_secret_iam_member.ksa-access["github-app-backstage-bits-credentials"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/github-app-backstage-bits-credentials/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage-dev/sa/backstage]
google_secret_manager_secret_iam_member.ksa-access["backstage-soundcheck-slack-bot-token"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/backstage-soundcheck-slack-bot-token/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage-dev/sa/backstage]
google_secret_manager_secret_iam_member.ksa-access["backstage-insights-token"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/backstage-insights-token/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage-dev/sa/backstage]
google_secret_manager_secret_iam_member.ksa-access["auth-google-client-secret"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/auth-google-client-secret/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage-dev/sa/backstage]
google_secret_manager_secret_iam_member.ksa-access["auth-github-client-secret"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/auth-github-client-secret/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage-dev/sa/backstage]
google_secret_manager_secret_iam_member.ksa-access["auth-google-client-id"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/auth-google-client-id/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage-dev/sa/backstage]
google_secret_manager_secret_iam_member.ksa-access["pagerduty-client-id"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/pagerduty-client-id/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage-dev/sa/backstage]
google_secret_manager_secret_iam_member.ksa-access["backstage-license-key"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/backstage-license-key/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage-dev/sa/backstage]
google_secret_manager_secret_iam_member.ksa-access["pagerduty-client-secret"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/pagerduty-client-secret/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage-dev/sa/backstage]
module.postgres.google_sql_database_instance.default: Refreshing state... [id=backstage-dev]
module.postgres.data.google_compute_zones.available[0]: Reading...
google_storage_bucket_iam_member.service-account: Refreshing state... [id=b/bits-backstage-dev-techdocs/roles/storage.admin/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
google_service_account_iam_member.db_workload_identity: Refreshing state... [id=projects/bits-backstage-dev/serviceAccounts/backstage@bits-backstage-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:bits-gke-clusters.svc.id.goog[backstage-dev/backstage]]
module.postgres.google_sql_database.additional_databases["backstage_plugin_skill-exchange"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_skill-exchange]
module.postgres.google_sql_database.additional_databases["backstage_plugin_permission"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_permission]
module.postgres.google_sql_database.additional_databases["backstage_plugin_search"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_search]
module.postgres.google_sql_database.additional_databases["backstage_plugin_soundcheck"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_soundcheck]
module.postgres.google_sql_database.additional_databases["backstage_plugin_backstage-insights"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_backstage-insights]
module.postgres.google_sql_database.additional_databases["backstage_plugin_tech-radar"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_tech-radar]
module.postgres.google_sql_database.additional_databases["backstage_plugin_catalog"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_catalog]
module.postgres.google_sql_database.additional_databases["backstage_plugin_app"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_app]
module.postgres.google_sql_database.additional_databases["backstage_plugin_rbac"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_rbac]
module.postgres.data.google_compute_zones.available[0]: Read complete after 1s [id=projects/bits-backstage-dev/regions/us-east4]
module.postgres.google_sql_database.additional_databases["backstage_plugin_scaffolder"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_scaffolder]
module.postgres.google_sql_database.additional_databases["backstage_plugin_auth"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_auth]
module.postgres.google_sql_database.additional_databases["backstage_plugin_kubernetes"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_kubernetes]
module.postgres.google_sql_database.additional_databases["backstage_plugin_pagerduty"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_pagerduty]
module.postgres.google_sql_database.additional_databases["backstage_plugin_techdocs"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_techdocs]
module.postgres.google_sql_database.additional_databases["backstage_plugin_proxy"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_proxy]
module.postgres.random_password.user-password[0]: Refreshing state... [id=none]
module.postgres.google_sql_user.iam_account["backstage"]: Refreshing state... [id=backstage@bits-backstage-dev.iam//backstage-dev]
module.postgres.google_sql_database.default[0]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage]
module.postgres.google_sql_user.default[0]: Refreshing state... [id=backstage//backstage-dev]
postgresql_grant.table_permissions["backstage_plugin_catalog"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_catalog_public_table]
postgresql_grant.table_permissions["backstage_plugin_skill-exchange"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_skill-exchange_public_table]
postgresql_grant.table_permissions["backstage"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_public_table]
postgresql_grant.table_permissions["backstage_plugin_backstage-insights"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_backstage-insights_public_table]
postgresql_grant.table_permissions["backstage_plugin_pagerduty"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_pagerduty_public_table]
postgresql_grant.table_permissions["backstage_plugin_soundcheck"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_soundcheck_public_table]
postgresql_grant.schema_usage_create["backstage_plugin_soundcheck"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_soundcheck_public_schema]
postgresql_grant.table_permissions["backstage_plugin_techdocs"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_techdocs_public_table]
postgresql_grant.table_permissions["backstage_plugin_rbac"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_rbac_public_table]
postgresql_grant.table_permissions["backstage_plugin_tech-radar"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_tech-radar_public_table]
postgresql_grant.schema_usage_create["backstage_plugin_kubernetes"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_kubernetes_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_catalog"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_catalog_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_pagerduty"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_pagerduty_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_search"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_search_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_skill-exchange"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_skill-exchange_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_scaffolder"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_scaffolder_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_backstage-insights"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_backstage-insights_public_schema]
postgresql_grant.table_permissions["backstage_plugin_proxy"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_proxy_public_table]
postgresql_grant.table_permissions["backstage_plugin_auth"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_auth_public_table]
postgresql_grant.table_permissions["backstage_plugin_scaffolder"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_scaffolder_public_table]
postgresql_grant.table_permissions["backstage_plugin_kubernetes"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_kubernetes_public_table]
postgresql_grant.table_permissions["backstage_plugin_search"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_search_public_table]
postgresql_grant.table_permissions["backstage_plugin_permission"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_permission_public_table]
postgresql_grant.schema_usage_create["backstage_plugin_app"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_app_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_auth"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_auth_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_permission"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_permission_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_proxy"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_proxy_public_schema]
postgresql_grant.schema_usage_create["backstage"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_techdocs"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_techdocs_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_rbac"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_rbac_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_tech-radar"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_tech-radar_public_schema]
postgresql_grant.table_permissions["backstage_plugin_app"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_app_public_table]
postgresql_grant.database_connect["backstage_plugin_app"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_app_database]
postgresql_grant.database_connect["backstage_plugin_rbac"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_rbac_database]
postgresql_grant.database_connect["backstage_plugin_catalog"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_catalog_database]
postgresql_grant.database_connect["backstage_plugin_backstage-insights"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_backstage-insights_database]
postgresql_grant.database_connect["backstage_plugin_tech-radar"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_tech-radar_database]
postgresql_grant.database_connect["backstage_plugin_proxy"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_proxy_database]
postgresql_grant.database_connect["backstage_plugin_pagerduty"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_pagerduty_database]
postgresql_grant.database_connect["backstage_plugin_techdocs"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_techdocs_database]
postgresql_grant.database_connect["backstage"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_database]
postgresql_grant.database_connect["backstage_plugin_scaffolder"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_scaffolder_database]
postgresql_grant.database_connect["backstage_plugin_auth"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_auth_database]
postgresql_grant.database_connect["backstage_plugin_soundcheck"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_soundcheck_database]
postgresql_grant.database_connect["backstage_plugin_kubernetes"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_kubernetes_database]
postgresql_grant.database_connect["backstage_plugin_search"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_search_database]
postgresql_grant.database_connect["backstage_plugin_permission"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_permission_database]
postgresql_grant.database_connect["backstage_plugin_skill-exchange"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_skill-exchange_database]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.postgres.google_sql_database_instance.default has changed
  ~ resource "google_sql_database_instance" "default" {
      ~ available_maintenance_versions = [
          ~ "POSTGRES_15_12.R20250302.00_04" -> "POSTGRES_15_12.R20250302.00_12",
        ]
        id                             = "backstage-dev"
      ~ maintenance_version            = "POSTGRES_15_10.R20250112.01_03" -> "POSTGRES_15_12.R20250302.00_04"
        name                           = "backstage-dev"
        # (17 unchanged attributes hidden)

      ~ settings {
          ~ version                      = 170 -> 225
            # (16 unchanged attributes hidden)

            # (8 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # google_secret_manager_secret.backstage-bits-credentials["backstage-soundcheck-http-collector-token"] will be created
  + resource "google_secret_manager_secret" "backstage-bits-credentials" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "created-by"                 = "terraform"
          + "goog-terraform-provisioned" = "true"
          + "service"                    = "backstage"
          + "terraform-module"           = "terraform-bits-backstage-dev"
          + "type"                       = "string"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "created-by"       = "terraform"
          + "service"          = "backstage"
          + "terraform-module" = "terraform-bits-backstage-dev"
          + "type"             = "string"
        }
      + name                  = (known after apply)
      + project               = "bits-backstage-dev"
      + secret_id             = "backstage-soundcheck-http-collector-token"
      + terraform_labels      = {
          + "created-by"                 = "terraform"
          + "goog-terraform-provisioned" = "true"
          + "service"                    = "backstage"
          + "terraform-module"           = "terraform-bits-backstage-dev"
          + "type"                       = "string"
        }

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret_iam_member.ksa-access["backstage-soundcheck-http-collector-token"] will be created
  + resource "google_secret_manager_secret_iam_member" "ksa-access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage-dev/sa/backstage"
      + project   = "bits-backstage-dev"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "backstage-soundcheck-http-collector-token"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Error: could not check if database exists: pq: remaining connection slots are reserved for non-replication superuser connections
│ 
│   with postgresql_grant.schema_usage_create["backstage_plugin_kubernetes"],
│   on database.tf line 85, in resource "postgresql_grant" "schema_usage_create":
│   85: resource "postgresql_grant" "schema_usage_create" {
│ 
╵
╷
│ Error: could not start transaction: pq: remaining connection slots are reserved for non-replication superuser connections
│ 
│   with postgresql_grant.table_permissions["backstage"],
│   on database.tf line 99, in resource "postgresql_grant" "table_permissions":
│   99: resource "postgresql_grant" "table_permissions" {
│ 
╵
╷
│ Error: could not start transaction: pq: remaining connection slots are reserved for non-replication superuser connections
│ 
│   with postgresql_grant.table_permissions["backstage_plugin_proxy"],
│   on database.tf line 99, in resource "postgresql_grant" "table_permissions":
│   99: resource "postgresql_grant" "table_permissions" {
│ 
╵


```
</details>

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed